{
  "scriptData": {
    "title": "PULP FICTION",
    "coreIdea": "PULP [pulp] n. 1. A soft, moist, shapeless mass or matter. 2. A magazine or book containing lurid subject matter and being characteristically printed on rough, unfinished paper.",
    "author": "Quentin Tarantino & Roger Avary",
    "version": "1.0"
  },
  "outline": {
    "opening": "",
    "theme": "",
    "setup": "",
    "catalyst": "",
    "debate": "",
    "break1": "",
    "bstory": "",
    "fun": "",
    "midpoint": "",
    "badguys": "",
    "allislost": "",
    "darksoul": "",
    "break2": "",
    "finale": "",
    "final": ""
  },
  "scenes": [
    {
      "id": "scene-1",
      "number": 1,
      "title": "INT. COFFEE SHOP",
      "location": "COFFEE SHOP",
      "dayNight": "MORNING",
      "content": "A normal Denny's, Spires-like coffee shop in Los Angeles. It's about 9:00 in the morning. While the place isn't jammed, there's a healthy number of people drinking coffee, munching on bacon and eating eggs.\nTwo of these people are a YOUNG MAN and a YOUNG WOMAN. The Young Man has a slight working-class English accent and, like his fellow countryman, smokes cigarettes like they're going out of style.\nIt is impossible to tell where the Young Woman is from or how old she is; everything she does contradicts something she did. The boy and girl sit in a booth. Their dialogue is to be said in a rapidpace \"HIS GIRL FRIDAY\" fashion.\n### YOUNG MAN\n> No, forget it, it's too risky. I'm through\n> doin' that shit.\n### YOUNG WOMAN\n> You always say that, the same thing every\n> time: never again, I'm through, too\n> dangerous.\n### YOUNG MAN\n> I know that's what I always say. I'm\n> always right too, but -\n### YOUNG WOMAN\n### YOUNG MAN\n> are over, and the days of me rememberin'\n> have just begun.\n### YOUNG WOMAN\n> When you go on like this, you know what\n> you sound like?\n### YOUNG MAN\n> I sound like a sensible fucking man, is\n> what I sound like.\n### YOUNG WOMAN (imitates a duck)\n> You sound like a duck.\n> Quack, quack, quack, quack, quack, quack, quack...\n### YOUNG MAN\n> Well take heart, 'cause you're never gonna\n> hafta hear it again. Because since I'm never gonna do it again, you're never gonna hafta hear me quack about how I'm never gonna do it again.\n### YOUNG WOMAN\n> After tonight.\n> The boy and girl laugh, their laughter putting a pause in there, back and forth.\n### YOUNG MAN (with a smile)\n> Correct. I got all tonight to quack.\n> A WAITRESS comes by with a pot of coffee.\n### WAITRESS\n> Can I get anybody anymore coffee?\n### YOUNG WOMAN\n> Oh yes, thank you.\n> The Waitress pours the Young Woman's coffee. The Young Man lights up another cigarette.\n### YOUNG MAN\n> I'm doin' fine.\n> The Waitress leaves. The Young Man takes a drag off of his smoke. The Young Woman pours a ton of cream and sugar into her coffee.\nThe Young Man goes right back into it.\n### YOUNG MAN\n> I mean the way it is now, you're takin' the same fuckin' risk as when you rob a bank. You take more of a risk. Banks are easier! Federal banks aren't supposed to stop you anyway, during a robbery. They're insured, why should they care? You don't even need a gun in a federal bank. I heard about this guy, walked into a federal bank with a portable phone, handed the phone to the teller, the guy on the other end of the phone said: \"We got this guy's little girl, and if you don't give him all your money, we're gonna kill 'er.\"\n### YOUNG WOMAN\n> Did it work?\n### YOUNG MAN\n> Fuckin' A it worked, that's what I'm\n> talkin' about! Knucklehead walks in a bank with a telephone, not a pistol, not a shotgun, but a fuckin' phone, cleans the place out, and they don't lift a fuckin' finger.\n### YOUNG WOMAN\n> Did they hurt the little girl?\n### YOUNG MAN\n> I don't know. There probably never was a little girl - the point of the story isn't the little girl. The point of the story is they robbed the bank with a telephone.\n### YOUNG WOMAN\n> You wanna rob banks?\n### YOUNG MAN\n> I'm not sayin' I wanna rob banks, I'm just\n> illustrating that if we did, it would be easier than what we been doin'.\n### YOUNG WOMAN\n> So you don't want to be a bank robber?\n### YOUNG MAN\n> Naw, all those guys are goin' down the same road, either dead or servin' twenty.\n### YOUNG WOMAN\n> And no more liquor stores?\n### YOUNG MAN\n> What have we been talking about? Yeah, no-more-liquor-stores. Besides, it ain't the giggle it usta be. Too many foreigners own liquor stores. Vietnamese, Koreans, they can't fuckin' speak English. You tell 'em: \"Empty out the register,\" and they don't know what it fuckin' means. They make it too personal. We keep on, one of those\n> gook motherfuckers' gonna make us kill 'em.\n### YOUNG WOMAN\n> I'm not gonna kill anybody.\n### YOUNG MAN\n> I don't wanna kill anybody either. But they'll probably put us in a situation where it's us of them. And if it's not the\n> gooks, it these old Jews who've owned the store for fifteen fuckin' generations. Ya got Grandpa Irving sittin' behind the counter with a fuckin' Magnum. Try walkin' into one of those stores with nothin' but a telephone, see how far it gets you. Fuck it, forget it, we're out of it.\n### YOUNG WOMAN\n> Well, what else is there, day jobs?\n### YOUNG MAN (laughing)\n> Not this life.\n### YOUNG WOMAN\n> Well what then?\n> He calls to the Waitress.\n### YOUNG MAN\n> Garcon! Coffee!\n> Then looks to his girl.\n### YOUNG MAN\n> This place.\n> The Waitress comes by, pouring him some more.\n### WAITRESS (snotty)\n> \"Garcon\" means boy.\n> She splits.\n### YOUNG WOMAN\n> Here? It's a coffee shop.\n### YOUNG MAN\n> What's wrong with that? People never rob restaurants, why not? Bars, liquor stores, gas stations, you get your head blown off stickin' up one of them. Restaurants, on the other hand, you catch with their pants down. They're not expecting to get robbed, or not as expecting.\n### YOUNG WOMAN (taking to idea)\n> I bet in places like this you couldcut\n> down on the hero factor.\n### YOUNG MAN\n> Correct. Just like banks, these places are\n> insured. The managers don't give a fuck,\n> they're just tryin' to get ya out the door\n> before you start pluggin' diners.\n> Waitresses, forget it, they ain't takin' a\n> bullet for the register. Busboys, some\n> wetback gettin' paid a dollar fifty a hour\n> gonna really give a fuck you're stealin'\n> from the owner. Customers are sittin'\n> there with food in their mouths, they\n> don't know what's goin' on. One minute\n> they're havin' a Denver omelette, next\n> minute somebody's stickin' a gun in their\n> face.\nThe Young Woman visibly takes in the idea. The Young Man continues in a low voice.\n### YOUNG MAN\n> See, I got the idea last liquor store we\n> stuck up. 'Member all those customers kept\n> comin' in?\n### YOUNG WOMAN\n> Yeah.\n### YOUNG MAN\n> They you got the idea to take everybody's\n> wallet.\n### YOUNG WOMAN\n> Uh-huh.\n### YOUNG MAN\n> That was a good idea.\n### YOUNG WOMAN\n> Thanks.\n### YOUNG MAN\n> We made more from the wallets then we did\n> the register.\n### YOUNG WOMAN\n> Yes we did.\n### YOUNG MAN\n> A lot of people go to restaurants.\n### YOUNG WOMAN\n> A lot of wallets.\n### YOUNG MAN\n> Pretty smart, huh?\nThe Young Woman scans the restaurant with this new information. She sees all the PATRONS eating, lost in conversations. The tires WAITRESS, taking orders. The BUSBOYS going through the motions,...\n### JULES (to himself)\n> It's cold.\n> He pushes it aside.\n> Vincent appears next to Jules.\n### VINCENT\n> I think we oughta leave now.\n### JULES\n> That's probably a good idea.\n> Vincent throws some money on the table and Jules grabs the briefcase.\nThen, to the amazement of the Patrons, the Waitresses, the Cooks, the Bus Boys, and the Manager, these two bad-ass dudes - wearing UC Santa Cruz and \"I'm with Stupid\" tee-shirts, swim trunks, thongs and packing . 45 Automatics - walk out of the coffee shop together without saying a word.",
      "beatId": null
    }
  ],
  "exportDate": "2025-11-22T07:43:44.325Z",
  "version": "1.0"
}